local L = LibStub("AceLocale-3.0"):NewLocale("PallyPower", "ruRU", false, false)
if not L then return end 
L["ALTMENU_LINE1"] = "может быть назначен"
L["ALTMENU_LINE2"] = "Обычное благословение от:"
L["AURA"] = "Кнопка Ауры"
L["AURA_DESC"] = "[|cffffd200Вкл|r/|cffffd200Выкл|r] Кнопка Ауры или выбор Ауры для отслеживания."
L["AURABTN"] = "Кнопка Ауры"
L["AURABTN_DESC"] = "[Вкл/Выкл] кнопку Ауры"
L["AURATRACKER"] = "Отслеживание Ауры"
L["AURATRACKER_DESC"] = "Выбор Ауры для отслеживания"
L["AUTO"] = "Кнопка Автобаффа"
L["AUTO_DESC"] = "[|cffffd200Вкл|r/|cffffd200Выкл|r] кнопку Автобаффа и [|cffffd200Вкл|r/|cffffd200Выкл|r] Ожидание игроков."
L["AUTOASSIGN"] = "Автоназначить"
L["AUTOASSIGN_DESC"] = [=[Автоназначение всех Благословений
в зависимости от количества доступных
паладинов и доступных им Благословений.

[Shift-ЛКМ]|r Использовать шаблон для
Полей Боя вместо Рейдового.]=]
L["AUTOBTN"] = "Кнопка Автобаффа"
L["AUTOBTN_DESC"] = "[Вкл/Выкл] кнопку Автобаффа"
L["AUTOKEY1"] = "Клавиша Обычного Благословения"
L["AUTOKEY1_DESC"] = "Назначение клавиши для автоматического баффа Обычным Благословением."
L["AUTOKEY2"] = "Клавиша Великого Благословения"
L["AUTOKEY2_DESC"] = "Назначение клавиши для автоматического баффа Великим Благословением."
L["BAP"] = "Размер окна назначения благословений"
L["BAP_DESC"] = "Это позволяет настроить общий размер окна назначений благословения"
L["BRPT"] = "Отчёт"
L["BRPT_DESC"] = [=[Оповещение о всех назначенных
Благословениях в заданный канал.]=]
L["BSC"] = "Масштаб кнопок баффа"
L["BSC_DESC"] = "Установить масштаб панели кнопок баффа"
L["BUFFDURATION"] = "Учит. длительность"
L["BUFFDURATION_DESC"] = "Если эта опция отключена, тогда кнопки «Класс» и «Игрок» будут игнорировать длительность эффекта, позволяя повторно использовать Благословение. Это особенно полезно для танков паладинов, когда они обновляют Великие благословения, чтобы генерировать больше угрозы."
L["BUTTONS"] = "Кнопки"
L["BUTTONS_DESC"] = "Изменение настроек кнопок"
L["CANCEL"] = "Отмена"
L["CLASSBTN"] = "Кнопки Классов"
L["CLASSBTN_DESC"] = "Если эта опция отключена, то кнопки игрока будут так же отключены, и вы сможете использовать только кнопку Автобаффа."
L["CPBTNS"] = "Кнопки Класса и Игрока"
L["CPBTNS_DESC"] = "[|cffffd200Вкл|r/|cffffd200Выкл|r] кнопки Игроков или Классов."
L["DISPEDGES"] = "Рамки"
L["DISPEDGES_DESC"] = "Смена рамок Кнопок"
L["DRAG"] = "Кнопка Перетаскивания"
L["DRAG_DESC"] = "[|cffffd200Вкл|r/|cffffd200Выкл|r] кнопку Перетаскивания."
L["DRAGHANDLE"] = [=[|cffffffff[ЛКМ]|r |cffff0000Заблокировать|r/|cff00ff00Разблокировать|r PallyPower
|cffffffff[Удерживать ЛКМ]|r Передвинуть PallyPower
|cffffffff[ПКМ]|r Открыть окно назначения Благословений
|cffffffff[Shift-ПКМ]|r Открыть окно Настроек]=]
L["DRAGHANDLE_ENABLED"] = "Кнопка Перетаскивания"
L["DRAGHANDLE_ENABLED_DESC"] = "[Вкл/Выкл] кнопку Перетаскивания"
L["ENABLEPP"] = "Всегда/Никогда"
L["ENABLEPP_DESC"] = "[Показать/Скрыть] PallyPower"
L["FREEASSIGN"] = "Вольный режим"
L["FREEASSIGN_DESC"] = [=[Разрешает другим паладинам изменять
благословения, не являясь лидером
группы (рейда) / помощником в рейде.]=]
L["FULLY_BUFFED"] = "Полные баффы"
L["HORLEFTDOWN"] = "По горизонтали слева | вниз"
L["HORLEFTUP"] = "По горизонтали слева | вверх"
L["HORRIGHTDOWN"] = "По горизонтальное вправо | вниз"
L["HORRIGHTUP"] = "По горизонтальное вправо | вверх"
L["LAYOUT"] = "Расположение кнопок баффов и игрока"
L["LAYOUT_DESC"] = "Вертикально [Слева/Справа] Горизонтально [Вверху/Внизу]"
L["MAINASSISTANT"] = "Автозамена Благословения для Наводчика"
L["MAINASSISTANT_DESC"] = "Если вы включите эту опцию, PallyPower автоматически перезапишет Великое благословение на Обычное благословением для игроков, помеченных ролью |cffffd200Наводчик|r в интерфейсе рейда. Это полезно, чтобы самостоятельно заменять Великое благословение спасения другим благословением для роли |cffffd200Наводчика|r кликая по кнопке игрока ПКМ."
L["MAINASSISTANTGBUFFDP"] = "Автозамена для Друидов/Паладинов..."
L["MAINASSISTANTGBUFFDP_DESC"] = "Выберите Великое Благословение для автозамены на другое Обычное Благословение для Друидов/Паладинов, отмеченных ролью Наводчика."
L["MAINASSISTANTGBUFFW"] = "Автозамена для Воинов..."
L["MAINASSISTANTGBUFFW_DESC"] = "Выберите Великое Благословение для автозамены на другое Обычное Благословение для Воинов, отмеченных ролью Наводчика."
L["MAINASSISTANTNBUFFDP"] = "...на Обычное Благословение..."
L["MAINASSISTANTNBUFFDP_DESC"] = "Выберите Обычное Благословение, которым будет заменяться Великое Благословение для Друидов/Паладинов, отмеченных ролью Наводчика."
L["MAINASSISTANTNBUFFW"] = "...на Обычное Благословение..."
L["MAINASSISTANTNBUFFW_DESC"] = "Выберите Обычное Благословение, которым будет заменяться Великое Благословение для Воинов, отмеченных ролью Наводчика."
L["MAINROLES"] = "Роли Главный танк / Наводчик"
L["MAINROLES_DESC"] = [=[Эти параметры можно использовать для автоматического назначения (автозамены)  любого Великого Благословения на Обычное Благословение, назначенного |cffff0000Воинам, Друидам или Паладинам|r.

Обычно роли |cffffd200Главный танк|r и |cffffd200Наводчик|r в рейдовом интерфейсе использовались для идентификации Главных Танков (МТ) и Вспомогательных Танков (ОТ), однако некоторые гильдии назначают роль |cffffd200Главный танк|r всем танкам, а роль |cffffd200Наводчик|r целителям. Наличие отдельных параметров для обеих ролей позволит удалить, например, Великое благословение спасения с танков, или назначить Друидам целителям, отмеченным ролью |cffffd200Наводчик|r автозамену Великого благословения могущества, назначенного на ДПС Друидов, на Благословение мудрости.

|cffffff00Примечание: если в рейде 5 или более Паладинов (достаточно, чтобы назначить все Великие Благословения), то эти настройки автоматически отключаются. Танкам необходимо снимать Великое благословение спасение самостоятельно.|r]=]
L["MAINTANKGBUFFDP"] = "Автозамена для Друидов/Паладинов..."
L["MAINTANKGBUFFDP_DESC"] = "Выберите Великое Благословение для автозамены на другое Обычное Благословение для Друидов/Паладинов, отмеченных ролью Главного Танка."
L["MAINTANKGBUFFW"] = "Автозамена для Воинов..."
L["MAINTANKGBUFFW_DESC"] = "Выберите великое благословение, которое хотите перебафать на главного танка: Воина."
L["MAINTANKNBUFFDP"] = "...на Обычное Благословение..."
L["MAINTANKNBUFFDP_DESC"] = "Выберите Обычное Благословение, которым будет заменяться Великое Благословение для Друидов/Паладинов, отмеченных ролью Главного Танка."
L["MAINTANKNBUFFW"] = "...на Обычное Благословение..."
L["MAINTANKNBUFFW_DESC"] = "Выберите обычное благословение, которое хотите перебафать на главного танка: Воина."
L["MINIMAPICON"] = [=[|cffffffff[ЛКМ]|r Открыть назначение благословений
|cffffffff[ПКМ]|r Открыть настройки]=]
L["NONE"] = "Нет"
L["NONE_BUFFED"] = "Нет баффов"
L["OPTIONS"] = "Настройки"
L["OPTIONS_DESC"] = "Открыть окно настроек PallyPower."
L["PARTIALLY_BUFFED"] = "Неполные баффы"
L["PLAYERBTNS"] = "Кнопки Игроков"
L["PLAYERBTNS_DESC"] = "Если эта опция отключена, то вы больше не увидите всплывающие кнопки при наведении на кнопку Класса, показывающие отдельных игроков. Вы не сможете повторно применить Обычные благословения в бою."
L["PP_CLEAR"] = "Сброс"
L["PP_CLEAR_DESC"] = [=[Очищает все назначенные
Благословения для всех
Паладинов в группе/рейде]=]
L["PP_COLOR"] = "Изменить цвет статуса кнопок баффов"
L["PP_LOOKS"] = "Изменить внешний вид PallyPower"
L["PP_MAIN"] = "Когда показывать PallyPower"
L["PP_NAME"] = "PallyPower"
L["PP_RAS1"] = "---  Благословения Паладинов ---"
L["PP_RAS2"] = "--- Конец назначений ---"
L["PP_RAS3"] = "ВНИМАНИЕ: В рейде более 5 паладинов."
L["PP_RAS4"] = "Танки, вручную снимите Благословение спасения!"
L["PP_REFRESH"] = "Обновить"
L["PP_REFRESH_DESC"] = [=[Обновить все назначенные
Благословения, Таланты,
Знаки королей для Паладинов
в группе/рейде]=]
L["PP_RESET"] = "На случай, если вы все испортили"
L["PPMAINTANK"] = "Автобафф Главного танка"
L["PPMAINTANK_DESC"] = "Если вы включите эту опцию, PallyPower автоматически перезапишет Великое благословение Обычным Благословением для игроков, помеченных ролью |cffffd200Главный танк|r в интерфейсе рейда. Это полезно, чтобы самостоятельно заменять Великое благословение спасения другим благословением для роли |cffffd200Главного танка|r кликая по кнопке игрока ПКМ."
L["RAID"] = "Рейд"
L["RAID_DESC"] = "Настройки только для рейда"
L["REPORTCHANNEL"] = "Канал для Отчёта"
L["REPORTCHANNEL_DESC"] = [=[Установите канал для Отчёта о Благословениях:

|cffffd200[Нет]|r Канал в зависимости от размера группы (Группа/Рейд)

|cffffd200[Список каналов]|r Автоматически заполненный список каналов, основанный на каналах, к которым игрок присоединился.|nКаналы по умолчанию, такие как Торговля, Общий и т. д. автоматически отфильтровываются из списка.

|cffffff00Примечание: если вы измените свой порядок каналов, вам потребуется перезагрузить интерфейс и убедиться, что он вещает на правильный канал.|r]=]
L["RESET"] = "Сброс рамок"
L["RESET_DESC"] = "Вернуть все рамки PallyPower в центр"
L["RESIZEGRIP"] = [=[ЛКМ и удерживание, для изменения размера.
ПКМ сбрасывает размер до изначального]=]
L["RFM"] = "Праведное неистовство"
L["RFM_DESC"] = "[Вкл/Выкл] кнопку Праведного неистовства"
L["SALVCOMBAT"] = "Сальва в бою"
L["SALVCOMBAT_DESC"] = [=[Если эта опция включена, то вы сможете баффать Воинов, Друидов и Паладинов Великим благословением спасения пока находитесь в бою 

|cffffff00Примечание: эта настройка работает ТОЛЬКО в рейдовой группе, т.к. по традиции большинство танков использует аддоны для автоматического снятия баффов, которые работают только вне боя. Эта опция нужна для предотвращения случайного применения Благословения спасения на танков в бою.]=]
L["SEAL"] = "Кнопка Печати и Праведного неистовства"
L["SEAL_DESC"] = "[|cffffd200Вкл|r/|cffffd200Выкл|r] кнопку Печати, [|cffffd200Вкл|r/|cffffd200Выкл|r] Праведное неистовство или выбрать Печать для отслеживания."
L["SEALBTN"] = "Кнопка Печати"
L["SEALBTN_DESC"] = "[Включить / Отключить] Кнопка тюлень"
L["SEALTRACKER"] = "Отслеживание Печати"
L["SEALTRACKER_DESC"] = "Выбор Печати для отслеживания"
L["SETTINGS"] = "Настройки"
L["SETTINGS_DESC"] = "Изменение общих настроек"
L["SETTINGSBUFF"] = "Что баффать при помощи PallyPower"
L["SHOWMINIMAPICON"] = "Иконка у миникарты"
L["SHOWMINIMAPICON_DESC"] = "[Показат/Скрыть] иконку у миникарты"
L["SHOWPETS"] = "Показывать питомцев"
L["SHOWPETS_DESC"] = [=[Если эта опция включена, то питомцы будут отображаться как отдельный класс.

|cffffff00Примечание: из-за того, как работают Великие Благословения, питомцев необходимо баффать отдельно. Также Бес Чернокнижника будет скрыт, если включено Бегство в астрал.]=]
L["SHOWTIPS"] = "Показывать подсказки"
L["SHOWTIPS_DESC"] = "[Показать/Скрыть] подсказки PallyPower"
L["SKIN"] = "Текстура фона кнопок"
L["SKIN_DESC"] = "Изменить текстуру фона кнопки"
L["SMARTBUFF"] = "Умные баффы"
L["SMARTBUFF_DESC"] = "Если эта опция включена, то запрещает назначать Благословение мудрости для Воинов или Разбойников и Благословение могущества для Магов, Чернокнижников и Охотников."
L["USEPARTY"] = "В группе"
L["USEPARTY_DESC"] = "[Показывать/Скрыть] PallyPower в группе"
L["USESOLO"] = "При игре в одиночку"
L["USESOLO_DESC"] = "[Показать/Скрыть] PallyPower при игре в одиночку"
L["VERDOWNLEFT"] = "По вертикали вниз | слева"
L["VERDOWNRIGHT"] = "По вертикали вниз | справа"
L["VERUPLEFT"] = "По вертикали вверх | слева"
L["VERUPRIGHT"] = "По вертикали вверх | справа"
L["WAIT"] = "Ожидать игроков"
L["WAIT_DESC"] = "Если эта опция включена, то кнопка Автобаффа не будет автоматически пытаться бафать класс Великим Благословением или игрока Обычным Благословением, если они мертвы, не в сети или не находятся в пределах досягаемости."

