if not BG.IsVanilla_Sod() then return end

local _, ADDONSELF = ...

local LibBG = ADDONSELF.LibBG
local L = ADDONSELF.L

local ClassQuest = ADDONSELF.ClassQuest
local RR = ADDONSELF.RR
local NN = ADDONSELF.NN
local RN = ADDONSELF.RN

local pt = print

-- 副本掉落
do
    -- P1
    do
        local FB = "BD"

        -- BD黑暗深渊
        do
            BG.Loot[FB].N.boss1 = { 209676, 209828, 209423, 204804, 211852, 209421, 209825, 209422, 209677, 204807, 209590, }
            BG.Loot[FB].N.boss2 = { 209678, 209824, 209418, 209675, 209524, 209432, 209523, 209436, 209424, 209830, }
            BG.Loot[FB].N.boss3 = { 211843, 211789, 211842, 209679, 209527, 209566, 209680, 209823, 209565, 209564, 209525, 209822, 209563, }
            BG.Loot[FB].N.boss4 = { 209572, 209568, 209569, 209670, 209820, 209821, 211505, 211510, 211507, 209683, 211504, 211512, 211509, 209671, 211506, 211508, 211511, 209669, 209573, 209559, 209567, 209570, 209571, 209681, 211491 }
            BG.Loot[FB].N.boss5 = { 209682, 209578, 209581, 211505, 211510, 211507, 209683, 211504, 211512, 211509, 209671, 211506, 211508, 211511, 209669, 209577, 209560, 209818, 209579, 209574, 209576, 209575 }
            BG.Loot[FB].N.boss6 = { 211455, 209672, 211457, 209667, 209668, 209673, 209686, 209817, 211505, 211507, 211510, 211504, 211512, 211506, 211511, 209694, 211458, 209674, 209816, 209561, 211492 }
            BG.Loot[FB].N.boss7 = { 209690, 209692, 209687, 209685, 209684, 209689, 211505, 211510, 209669, 211508, 211511, 209580, 211456, 209688, 209691, 209562, 209534 }
            BG.Loot[FB].N.boss8 = { 1486, 3416, 1491, 3414, 1454, 1481, 2567, 3413, 3417, 3415, 2271, }
            BG.Loot[FB].N.boss7other = { 211451, 211450, 211449 }

            if BG.IsHorde() then -- BL
                tinsert(BG.Loot.BD.N.boss7, 1, 211452)
            else
                tinsert(BG.Loot.BD.N.boss7, 1, 209693)
            end

            BG.Loot[FB].N.Quest = {}
            BG.Loot[FB].N.Quest[BG.STC_y1(QUESTS_LABEL)] = { 211461, 211460, }
            if BG.IsAlliance() then
                BG.Loot[FB].N.Quest[BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] =
                { 211462, 211465, 211466, 211463, 211464, }
            end
            if BG.IsHorde() then
                BG.Loot[FB].N.Quest[BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] =
                { 211467, 211468, 16886, 16887 }
            end
        end

        -- 死亡矿井
        do
            local FB_5 = GetRealZoneText(36)
            BG.Loot.BD.Team[FB_5] = {
                [L["矿工约翰森"]] = { 5443, },
                [L["斯尼德"]] = { 5194, },
                [L["基尔尼格"]] = { 1156, },
                [L["重锤先生"]] = { 7230, },
                [L["绿皮队长"]] = { 5201, },
                [L["艾德温·范克里夫"]] = { 5193, 5202, 10399, 5191, },
                [L["曲奇"]] = { 5198, },
            }
            if BG.IsAlliance() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = { 6087, 2041, 2042 }
            end
        end
        -- 哀嚎洞穴
        do
            local FB_5 = GetRealZoneText(43)
            BG.Loot.BD.Team[FB_5] = {
                [L["考布莱恩"]] = { 6460, 10410, },
                [L["克雷什"]] = { 13245, },
                [L["皮萨斯"]] = { 6472, },
                [L["斯卡姆"]] = { 6449, },
                [L["瑟芬迪斯"]] = { 6469, },
                [L["永生者沃尔丹"]] = { 6630, 6631, },
                [L["吞噬者穆坦努斯"]] = { 6461, 6627, 6463, },
                [L["变异精灵龙"]] = { 5243, },
            }
            if BG.IsHorde() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = { 6506, 6504 }
            end
        end
        -- 影牙城堡
        do
            local FB_5 = GetRealZoneText(33)
            BG.Loot.BD.Team[FB_5] = {
                [L["屠夫拉佐克劳"]] = { 1292, },
                [L["席瓦莱恩男爵"]] = { 6321, },
                [L["指挥官"]] = { 6320, },
                [L["盲眼守卫奥杜"]] = { 6318, },
                [L["幻影之甲"]] = { 6642, },
                [L["狼王南杜斯"]] = { 3748, },
                [L["大法师阿鲁高"]] = { 6324, 6392, 6220, },
                [L["小怪"]] = { 2292, 1489, 1974, 2807, 1482, 1935, 1483, 1318, 3194, 2205, 1484, },
            }
            if BG.IsAlliance() then
                BG.Loot.BD.Team[FB_5][ClassQuest(2)] = { 6953 }
            end
            if BG.IsHorde() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = { 6414 }
            end
        end
        -- 监狱
        do
            local FB_5 = GetRealZoneText(34)
            BG.Loot.BD.Team[FB_5] = {
                [L["布鲁高·铁拳"]] = { 3228, 2941, 2942, },
            }
            if BG.IsAlliance() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = { 2933 }
            end
        end
        -- 剃刀沼泽
        do
            local FB_5 = GetRealZoneText(47)
            BG.Loot.BD.Team[FB_5] = {
                [L["小怪"]] = { 2264, 4438, 1978, 2039, 1727, 1976, 1975, 2549, },
            }
            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    6972,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    7133,
                }
            end
        end
        -- 血色
        do
            local FB_5 = GetRealZoneText(189)
            BG.Loot.BD.Team[FB_5] = {
                [L["小怪"]] = { 7754, 7786, },
            }
        end
    end

    -- P2
    do
        local FB = "Gno"

        -- Gno诺莫瑞根
        do
            BG.Loot.Gno.N.boss1 = {}
            BG.Loot.Gno.N.boss2 = {}
            BG.Loot.Gno.N.boss3 = {}
            BG.Loot.Gno.N.boss4 = {}
            BG.Loot.Gno.N.boss5 = {}
            BG.Loot.Gno.N.boss6 = {}
            BG.Loot.Gno.N.boss7 = {}
        end

        -- 剃刀沼泽
        do
            local FB_5 = GetRealZoneText(47)
            BG.Loot[FB].Team[FB_5] = {
                [L["亡语者贾格巴"]] = { 2816, },
                [L["主宰拉姆塔斯"]] = { 6687, },
                [L["暴怒的阿迦赛罗斯"]] = { 6691, },
                [L["盲眼猎手"]] = { 6695, 6697, 6696, },
                [L["卡尔加·刺肋"]] = { 6693, 6694, 6692, },
                [L["唤地者哈穆加"]] = { 6689, },
                [L["小怪"]] = { 2264, 1488, 4438, 1978, 2039, 1727, 776, 1976, 1975, 2549, },
                [BG.STC_y1(QUESTS_LABEL)] = { 4197, 6725, 6742 },
            }
            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    6972,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    7133,
                }
            end
        end
        -- 血色
        do
            local FB_5 = GetRealZoneText(189)
            if BG.Is11501() then
                BG.Loot[FB].Team[FB_5] = {
                    [L["审讯员韦沙斯"]] = { 7682, },
                    [L["永醒的艾希尔"]] = { 7709, 217295, 217296, },
                    [L["死灵勇士"]] = { 217294, 7690, 7689, },
                    [L["铁脊死灵"]] = { 7688, 7687, 7686, },
                    [L["血法师萨尔诺斯"]] = { 7685, },
                    [L["驯犬者洛克希"]] = { 7710, },
                    [L["奥法师杜安"]] = { 7714, 217299, },
                    [L["赫洛德"]] = { 7719, 7718, 10330, 7717, },
                    [L["莫格莱尼"]] = { 7724, 10330, 7726, 217302, },
                    [L["怀特迈恩"]] = { 217300, 217301, 7721, },
                    [L["小怪"]] = { 5819, 7755, 7727, 7728, 7759, 7760, 7754, 10332, 1992, 2262, 7787,
                        7729, 7761, 7752, 8226, 7786, 5756, 7736, 8225, 7753, 7730, 7758, 7757, },
                }
            else
                BG.Loot[FB].Team[FB_5] = {
                    [L["审讯员韦沙斯"]] = { 7682, },
                    [L["永醒的艾希尔"]] = { 7709, 7708, 7731, },
                    [L["死灵勇士"]] = { 7691, 7690, 7689, },
                    [L["铁脊死灵"]] = { 7688, 7687, 7686, },
                    [L["血法师萨尔诺斯"]] = { 7685, },
                    [L["驯犬者洛克希"]] = { 7710, },
                    [L["奥法师杜安"]] = { 7714, 7713, },
                    [L["赫洛德"]] = { 7719, 7718, 10330, 7717, },
                    [L["莫格莱尼"]] = { 7724, 10330, 7726, 7723, },
                    [L["怀特迈恩"]] = { 7720, 7722, 7721, },
                    [L["小怪"]] = { 5819, 7755, 7727, 7728, 7759, 7760, 7754, 10332, 1992, 2262, 7787,
                        7729, 7761, 7752, 8226, 7786, 5756, 7736, 8225, 7753, 7730, 7758, 7757, },
                }
            end

            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = {
                    6830, 6829, 6831, 11262,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = {
                    6802, 6803, 10711,
                }
            end
        end
        -- 剃刀高地
        do
            local FB_5 = GetRealZoneText(129)
            if BG.Is11501() then
                BG.Loot[FB].Team[FB_5] = {
                    [L["图特卡什"]] = { 217293, 10775, 10777, },
                    [L["火眼莫德雷斯"]] = { 217290, 217292, 217291, },
                    [L["暴食者"]] = { 10774, },
                    [L["拉戈斯诺特"]] = { 10768, 10767, 10758, },
                    [L["寒冰之王亚门纳尔"]] = { 10763, 217288, 217289, 10761, },
                    [L["腐烂的普雷莫尔"]] = { 10766, },
                    [L["小怪"]] = { 10574, 10581, 10583, 10584, 10578, 10582, 10572, 10567, 10571, 10570, 10573, },
                    [BG.STC_y1(QUESTS_LABEL)] = { 10823, 10824, 10710 },
                }
            else
                BG.Loot[FB].Team[FB_5] = {
                    [L["图特卡什"]] = { 10776, 10775, 10777, },
                    [L["火眼莫德雷斯"]] = { 10769, 10771, 10770, },
                    [L["暴食者"]] = { 10774, },
                    [L["拉戈斯诺特"]] = { 10768, 10767, 10758, },
                    [L["寒冰之王亚门纳尔"]] = { 10763, 10762, 10764, 10761, },
                    [L["腐烂的普雷莫尔"]] = { 10766, },
                    [L["小怪"]] = { 10574, 10581, 10583, 10584, 10578, 10582, 10572, 10567, 10571, 10570, 10573, },
                    [BG.STC_y1(QUESTS_LABEL)] = { 10823, 10824, 10710 },
                }
            end
        end
        -- 奥达曼
        do
            local FB_5 = GetRealZoneText(70)
            if BG.Is11501() then
                BG.Loot[FB].Team[FB_5] = {
                    [L["鲁维罗什"]] = { 217304, 217307, 217305, 217306 },
                    [L["艾隆纳亚"]] = { 9409, 217303, 9408, },
                    [L["石头看守者"]] = { 9410, },
                    [L["小怪"]] = { 9431, 9429, 9420, 9430, 9397, 9406, 9428, 9432, 9396, 9393, 9381, 9426, 9422,
                        9465, 9384, 9386, 9427, 9392, 9424, 9383, 9425, 9423, 9391, },
                    [ClassQuest(8)] = { 9517, 7515 },
                }
            else
                BG.Loot[FB].Team[FB_5] = {
                    [L["艾隆纳亚"]] = { 9409, 9407, 9408, },
                    [L["石头看守者"]] = { 9410, },
                    [L["小怪"]] = { 9431, 9429, 9420, 9430, 9397, 9406, 9428, 9432, 9396, 9393, 9381, 9426, 9422,
                        9465, 9384, 9386, 9427, 9392, 9424, 9383, 9425, 9423, 9391, },
                    [ClassQuest(8)] = { 9517, 7515 },
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][L["埃瑞克"]] = { 9394, }
                BG.Loot[FB].Team[FB_5][L["巴尔洛戈"]] = { 9401, }
                BG.Loot[FB].Team[FB_5][L["奥拉夫"]] = { 9404, }
            end
        end
    end
end

-- 声望装备
do
    -- P1
    do
        local FB = "BD"
        if BG.IsAlliance() then
            -- 战歌
            BG.Loot[FB].Faction = {
                ["890:2"] = { 21568, 21566, },
                ["890:3"] = { 20444, 20428, 20431, 20439, },
                ["890:4"] = { 212580, 212581, 212582, 212583, },
            }
        end
        if BG.IsHorde() then
            -- 战歌
            BG.Loot[FB].Faction = {
                ["889:2"] = { 21568, 21566, },
                ["889:3"] = { 20442, 20427, 20426, 20429, },
                ["889:4"] = { 212584, 212585, 212586, 212587, },
            }
        end
    end
    -- P2
    do
        local FB = "Gno"
        if BG.IsAlliance() then
            BG.Loot[FB].Faction = {
                -- 战歌
                ["890:2"] = { 21567, 21565, },
                ["890:3"] = { 19540, 19532, 19524, 19515, },
                ["890:4"] = { 19564, 19548, 19556, 19572, },
                ["890:5"] = { 19597, 19590, 19584, 19581, },

                -- 阿拉希
                ["509:2"] = { 21119, 21118, },
                ["509:3"] = { 20099, 20117, 20105, 20090, 20108, 20126, 20098, 20116, 20104, 20089, 20107, 20125, },
                ["509:4"] = { 20096, 20114, 20102, 20093, 20111, 20129, 20095, 20113, 20101, 20092, 20110, 20128, },
            }
        end
        if BG.IsHorde() then
            -- 阿拉希
            BG.Loot[FB].Faction = {
                -- 战歌
                ["889:2"] = { 21567, 21565, },
                ["889:3"] = { 19536, 19528, 19520, 19512, },
                ["889:4"] = { 19560, 19544, 19552, 19568, },
                ["889:5"] = { 19597, 19590, 19584, 19581, },

                -- 阿拉希
                ["510:2"] = { 21120, 21116, },
                ["510:3"] = { 20164, 20191, 20172, 20152, 20197, 20207, 20166, 20192, 20173, 20153, 20198, 20206, },
                ["510:4"] = { 20162, 20188, 20169, 20157, 20201, 20210, 20161, 20187, 20168, 20156, 20200, 20209, },
            }
        end
    end
end

-- PVP
do
    -- P1
    do
        local FB = "BD"
        if BG.IsAlliance() then
            BG.Loot[FB].Pvp = {
                ["Alliance:2"] = { 18854, 18856, 18857, 18858, 18862, 18863, 18864, 18859 }, -- 徽记
                ["Alliance:3"] = { 213087 },                                                 -- 中士的披风
            }
        end
        if BG.IsHorde() then
            BG.Loot[FB].Pvp = {
                ["Horde:2"] = { 18834, 18846, 18849, 18852, 18851, 18853, 18845, 18850 }, -- 徽记
                ["Horde:3"] = { 213088 },                                                 -- 中士的披风
            }
        end
    end

    if BG.Is11501() then
        -- P2
        do
            local FB = "Gno"
            if BG.IsAlliance() then
                BG.Loot[FB].Pvp = {
                    ["Alliance:5"] = { 216938 }, -- 新徽记
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Pvp = {
                    ["Horde:5"] = { 216939 }, -- 新徽记
                }
            end
        end
    end
end

-- 专业制造
do
    -- P1
    local FB = "BD"
    BG.Loot[FB].Profession = {
        ["锻造"] = { 2870, 210794, 210773, },
        ["制皮"] = { 6468, 4253, 211423, 211502, },
        ["裁缝"] = { 4320, 210795, 210781, 215366, 215365 },
    }
    -- P2
    local FB = "Gno"
    if BG.Is11501() then
        BG.Loot[FB].Profession = {
            ["锻造"] = { 3844, 217275, 217279, 217277, 217273, 217285, 217283, 217281 },
            ["制皮"] = { 18238, 8345, 4262, 18948, 217265, 217263, 217267, 217268, 217270 },
            ["裁缝"] = { 4327, 10021, 7054, 10019, 217259, 217261, 217247, 217246, 217253, 217255, 217245, 217250, 217248, 217256, 217257, 217252 },
        }
    else
        BG.Loot[FB].Profession = {
            ["锻造"] = { 3844, },
            ["制皮"] = { 18238, 8345, 4262, 18948, },
            ["裁缝"] = { 4327, 10021, 7054, 10019, },
        }
    end
end

-- 任务
do
    -- P1
    do
        local FB = "BD"
        -- 专业
        BG.Loot[FB].Quest.Profession1 = {
            FBname = L["锻造/制皮/裁缝"],
            color = BG.y1,
        }
        BG.Loot[FB].Quest.Profession1.itemID = { 211420 }
    end
    -- P2
    do
        local FB = "Gno"
        BG.Loot[FB].Quest.FS = {
            FBname = "",
            color = BG.y1,
            classID = 8,
            itemID = { 7514, 7513, 11263 }
        }
        BG.Loot[FB].Quest.ZS = {
            FBname = "",
            color = BG.y1,
            classID = 1,
            itemID = { 6975, 6977, 6976 }
        }
        BG.Loot[FB].Quest.SS = {
            FBname = "",
            color = BG.y1,
            classID = 9,
            itemID = { 6900, 15108, 15107 }
        }
        if BG.IsHorde() then
            BG.Loot[FB].Quest.horde = {
                FBname = "",
                color = BG.y1,
                faction = 2,
                itemID = { 18585, 18586, }
            }
        end
    end
end

-- 世界掉落
do
    -- P1
    local FB = "BD"
    BG.Loot[FB].World = { 12978, 12977, 5183, 12982, 12979, 12988, 12987, 12985, 6332, 2879, 12996, 12994, 2911, 12997,
        2059, 1121, 12999, 12998, 13010, 2800, 13012, 13011, 13031, 13005, 720, 13131, 13099, 13097, 13114, 13094, 13079, 1717,
        12976, 12975, 5423, 935, 13136, 12984, 12983, 12989, 12992, 12990, 2256, 890, 3021, 2236, 2194, 13041, 13016, 4454, 4446, 2011, 13062,
        13032, 2098, 1493, 13057, 3203, 13024, 2878 }
    -- P2
    local FB = "Gno"
    BG.Loot[FB].World = {
        -- 武器
        873, 2825, 2164, 1982, 870, 869, 868,
        6327, 13026, 13138, 9359, 13064, 13034, 13038, 8223, 1602, 13045, 1722, 2912,
        2815, 2299, 937, 934, 13020, 12974, 1265, 13051, 8006, 13137, 13033, 6331, 9378, 13037, 13042,
        13049, 936, 13063, 7753, 9385, 13054, 13048, 13019, 13017, 791, 13058, 2877,
        13025, 1726,
        -- 护甲
        867, 1980, 1204, 14549, 1981,
        5257, 1718, 1716, 2278, 2721, 9375, 13095, 13117, 2951, 13108, 2276, 13071, 2802, 13110, 13068,
        13129, 13084, 2277, 1713, 13029, 13087, 9434, 13100, 13132, 13115, 1678, 13145, 13127,
        13081, 13121, 1714, 13093, 13088, 2565, 3020, 13199, 9435, 13103, 13106, 1715, 9395,
        9405, 13119, 13124, 13105,
    }
end

-- 赛季服特殊PVP事件
do
    if BG.Is11501() then
        -- P2
        local FB = "Gno"
        BG.Loot[FB].Sod_Pvp = {
            216498, 216499, 216500,
            216516, 216513,
            216510, 216511, 216512,
            216504, 216506, 216505, 216607,
            216518, 216519, 216517,
            216520, 216522, 216521,
            216501, 216502, 216615, 216503,
            216508, 216507, 216509,
            216496, 216495, 216497,
        }
        BG.Loot[FB].Sod_Pvp.get = L["荆棘谷血月活动"]
    end
end

-- 黑名单
BG.Loot.blacklist = {
    19708, 19713, 19715, 19711, 19710, 19712, 19707, 19714, 19709, -- ZUG蓝色宝石
    20873, 20869, 20866, 20870, 20868, 20871, 20867, 20872,        -- AQL小怪雕像
    20876, 20879, 20875, 20878, 20881, 20877, 20874, 20882,        -- TAQ大型圣甲虫箱开出的雕像
    21218, 21324, 21323, 21321,                                    -- TAQ蓝色坐骑
    22682, 22376, 22373, 22374, 22375,                             -- NAXX冰冻符文、布甲碎片等
    22727,                                                         -- 橙杖杖柄
}
-- 白名单
BG.Loot.whitelist = {
    17962, 17963, 17964, 17965, 17969, --[一袋宝石]
    17966,                             --[奥妮克希亚皮袋]
    11382,                             --[山脉之血]
    17012,                             --[熔火犬皮]
    19939, 19942, 19940, 19941,        --ZUG隐藏boss掉落的职业物品
    -- , --[]
    -- , --[]
}

-- BOSS战ID
do
    BG.Loot.encounterID = {
        BD = {
            ["2694"] = 1,
            ["2697"] = 2,
            ["2699"] = 3,
            ["2704"] = 4,
            ["2710"] = 5,
            ["2825"] = 6,
            ["2891"] = 7,
        },
        Gno = {
            ["2925"] = 1, -- 格\n鲁\n比\n斯
            ["2928"] = 2, -- 粘\n性\n辐\n射\n尘
            ["2927"] = 3, -- 电\n刑\n器\n6\n0\n0\n0\n型
            ["2899"] = 4, -- 群\n体\n打\n击\n者
            ["2935"] = 5, -- MechanicalMenagerie机械动物园
            ["2940"] = 6, -- 瑟\n玛\n普\n拉\n格
        }
    }
end
