if not BG.IsVanilla_Sod() then return end

local _, ADDONSELF = ...

local LibBG = ADDONSELF.LibBG
local L = ADDONSELF.L

local Size = ADDONSELF.Size
local ClassQuest = ADDONSELF.ClassQuest
local RR = ADDONSELF.RR
local NN = ADDONSELF.NN
local RN = ADDONSELF.RN

local pt = print

local LibRecipes = LibStub("LibRecipes-3.0")

local _, classFilename, classID = UnitClass("player")
--[[
1	Warrior	WARRIOR	
2	Paladin	PALADIN	
3	Hunter	HUNTER	
4	Rogue	ROGUE	
5	Priest	PRIEST	
6	Death Knight	DEATHKNIGHT
7	Shaman	SHAMAN	
8	Mage	MAGE	
9	Warlock	WARLOCK	
10	Monk	MONK
11	Druid	DRUID	 ]]

-- 副本掉落
do
    -- P1
    do
        local FB = "BD"

        -- BD黑暗深渊
        do
            BG.Loot[FB].N.boss1 = { 209676, 209828, 209423, 204804, 211852, 209421, 209825, 209422, 209677, 204807, 209590, }
            BG.Loot[FB].N.boss2 = { 209678, 209824, 209418, 209675, 209524, 209432, 209523, 209436, 209424, 209830, }
            BG.Loot[FB].N.boss3 = { 211843, 211789, 211842, 209679, 209527, 209566, 209680, 209823, 209565, 209564, 209525, 209822, 209563, }
            BG.Loot[FB].N.boss4 = { 209572, 209568, 209569, 209670, 209820, 209821, 211505, 211510, 211507, 209683, 211504, 211512, 211509, 209671, 211506, 211508, 211511, 209669, 209573, 209559, 209567, 209570, 209571, 209681, 211491 }
            BG.Loot[FB].N.boss5 = { 209682, 209578, 209581, 211505, 211510, 211507, 209683, 211504, 211512, 211509, 209671, 211506, 211508, 211511, 209669, 209577, 209560, 209818, 209579, 209574, 209576, 209575 }
            BG.Loot[FB].N.boss6 = { 211455, 209672, 211457, 209667, 209668, 209673, 209686, 209817, 211505, 211507, 211510, 211504, 211512, 211506, 211511, 209694, 211458, 209674, 209816, 209561, 211492 }
            BG.Loot[FB].N.boss7 = { 209690, 209692, 209687, 209685, 209684, 209689, 211505, 211510, 209669, 211508, 211511, 209580, 211456, 209688, 209691, 209562, 209534 }
            BG.Loot[FB].N.boss8 = { 1486, 3416, 1491, 3414, 1454, 1481, 2567, 3413, 3417, 3415, 2271, }
            BG.Loot[FB].N.boss7other = { 211451, 211450, 211449 }

            if BG.IsAlliance() then -- BL
                tinsert(BG.Loot.BD.N.boss7, 1, 209693)
            else
                tinsert(BG.Loot.BD.N.boss7, 1, 211452)
            end

            -- 兑换物
            if BG.IsAlliance() then
                BG.Loot[FB].ExchangeItems[209693] = { 211451, 211450, 211449, }
            else
                BG.Loot[FB].ExchangeItems[211452] = { 211451, 211450, 211449, }
            end
            for item, v in pairs(BG.Loot[FB].ExchangeItems) do -- 提前缓存
                GetItemInfo(item)
            end

            -- 团本任务奖励
            BG.Loot[FB].N.Quest[BG.STC_y1(QUESTS_LABEL)] = { 211461, 211460, }
            if BG.IsAlliance() then
                BG.Loot[FB].N.Quest[BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] =
                { 211462, 211465, 211466, 211463, 211464, }
            end
            if BG.IsHorde() then
                BG.Loot[FB].N.Quest[BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] =
                { 211467, 211468, 16886, 16887 }
            end
        end

        -- 死亡矿井
        do
            local FB_5 = GetRealZoneText(36)
            BG.Loot.BD.Team[FB_5] = {
                [L["矿工约翰森"]] = { 5443, },
                [L["斯尼德"]] = { 5194, },
                [L["基尔尼格"]] = { 1156, },
                [L["重锤先生"]] = { 7230, },
                [L["绿皮队长"]] = { 5201, },
                [L["艾德温·范克里夫"]] = { 5193, 5202, 10399, 5191, },
                [L["曲奇"]] = { 5198, },
            }
            if BG.IsAlliance() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = { 6087, 2041, 2042 }
            end
        end
        -- 哀嚎洞穴
        do
            local FB_5 = GetRealZoneText(43)
            BG.Loot.BD.Team[FB_5] = {
                [L["考布莱恩"]] = { 6460, 10410, },
                [L["克雷什"]] = { 13245, },
                [L["皮萨斯"]] = { 6472, },
                [L["斯卡姆"]] = { 6449, },
                [L["瑟芬迪斯"]] = { 6469, },
                [L["永生者沃尔丹"]] = { 6630, 6631, },
                [L["吞噬者穆坦努斯"]] = { 6461, 6627, 6463, },
                [L["变异精灵龙"]] = { 5243, },
            }
            if BG.IsHorde() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = { 6506, 6504 }
            end
        end
        -- 影牙城堡
        do
            local FB_5 = GetRealZoneText(33)
            BG.Loot.BD.Team[FB_5] = {
                [L["屠夫拉佐克劳"]] = { 1292, },
                [L["席瓦莱恩男爵"]] = { 6321, },
                [L["指挥官"]] = { 6320, },
                [L["盲眼守卫奥杜"]] = { 6318, },
                [L["幻影之甲"]] = { 6642, },
                [L["狼王南杜斯"]] = { 3748, },
                [L["大法师阿鲁高"]] = { 6324, 6392, 6220, },
                [L["小怪"]] = { 2292, 1489, 1974, 2807, 1482, 1935, 1483, 1318, 3194, 2205, 1484, },
            }
            if BG.IsAlliance() then
                BG.Loot.BD.Team[FB_5][ClassQuest(2)] = { 6953 }
            end
            if BG.IsHorde() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = { 6414 }
            end
        end
        -- 监狱
        do
            local FB_5 = GetRealZoneText(34)
            BG.Loot.BD.Team[FB_5] = {
                [L["布鲁高·铁拳"]] = { 3228, 2941, 2942, },
            }
            if BG.IsAlliance() then
                BG.Loot.BD.Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = { 2933 }
            end
        end
        -- 剃刀沼泽
        do
            local FB_5 = GetRealZoneText(47)
            BG.Loot.BD.Team[FB_5] = {
                [L["小怪"]] = { 2264, 4438, 1978, 2039, 1727, 1976, 1975, 2549, },
            }
            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    6972,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    7133,
                }
            end
        end
        -- 血色
        do
            local FB_5 = GetRealZoneText(189)
            BG.Loot.BD.Team[FB_5] = {
                [L["小怪"]] = { 7754, 7786, },
            }
        end
    end

    -- P2
    do
        local FB = "Gno"

        -- Gno诺莫瑞根
        do
            BG.Loot.Gno.N.boss1 = { 213294, 213288, 213304, 213322, 213321, 213323, 213327, 213324, 213326, 213351, 213542, 216490, 215435, 215436, 215437, }
            BG.Loot.Gno.N.boss2 = { 213307, 213290, 213299, 213302, 213301, 213413, 213285, 213289, 213352, 213355, 213291, 213353, }
            BG.Loot.Gno.N.boss3 = { 213340, 213278, 213305, 213317, 213415, 213292, 210741, 213408, 213295, 213442, 213419, 213412, 215449, }
            BG.Loot.Gno.N.boss4 = { 217009, 217007, 217008, 215377, 215379, 215378, 213309, 213298, 213287, 213319, 213300, 213279, 213414, 213418, 213354, 213560, 213559, 213293, 216494, 213286, }
            BG.Loot.Gno.N.boss5 = { 217009, 217007, 217008, 215377, 215379, 215378, 213306, 213308, 213320, 213280, 213417, 213303, 213325, 213318, 213296, 213297, 213411, 215380, 213410, }
            BG.Loot.Gno.N.boss6 = { 13325, 217009, 217007, 217008, 215377, 215379, 215378, 213281, 213349, 213348, 215461, 213347, 213350, 216608, 213283, 213284, 213282, 213416, 213409, 213356, }
            BG.Loot.Gno.N.boss7 = { 213427 }
            BG.Loot.Gno.N.boss4other = { 213310, 213311, 213328, 213329, 213336, 213337, 213312, 213313, 213331, 213332, 213341, 213342, 213314, 213315, 213333, 213334, 213338, 213339, 213316, 216485, 213330, 216486, 216484, 213335, }
            BG.Loot.Gno.N.boss5other = { 213310, 213311, 213328, 213329, 213336, 213337, 213312, 213313, 213331, 213332, 213341, 213342, 213314, 213315, 213333, 213334, 213338, 213339, 213316, 216485, 213330, 216486, 216484, 213335, }
            BG.Loot.Gno.N.boss6other = { 213343, 213344, 213345, 213346, 213310, 213311, 213328, 213329, 213336, 213337, 213312, 213313, 213331, 213332, 213341, 213342, 213314, 213315, 213333, 213334, 213338, 213339, 213316, 216485, 213330, 216486, 216484, 213335, }

            if BG.IsAlliance() then
                tinsert(BG.Loot.Gno.N.boss6, 1, 217350)
            else
                tinsert(BG.Loot.Gno.N.boss6, 1, 217351)
            end

            -- 兑换物
            BG.Loot[FB].ExchangeItems = {
                [217008] = { 213310, 213311, 213312, 213313, 213314, 213315, 213316, 216485, },
                [217009] = { 213328, 213329, 213331, 213332, 213333, 213334, 213330, 216486, },
                [217007] = { 213336, 213337, 213341, 213342, 213338, 213339, 216484, 213335, },
                [217496] = { 217497, }, -- 法师 纳帕斯之剑
            }
            if BG.IsAlliance() then
                BG.Loot[FB].ExchangeItems[217350] = { 213343, 213344, 213345, 213346, }
            else
                BG.Loot[FB].ExchangeItems[217351] = { 213343, 213344, 213345, 213346, }
            end
            for item, v in pairs(BG.Loot[FB].ExchangeItems) do -- 提前缓存
                GetItemInfo(item)
            end

            -- 团本任务奖励
            BG.Loot[FB].N.Quest[BG.STC_y1(QUESTS_LABEL)] = { 216675, 216676, 216678 }
            if BG.IsAlliance() then
                BG.Loot[FB].N.Quest[BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] =
                { 216680, 216679, 217005, 217006, 216673 }
            end
            if BG.IsHorde() then
                BG.Loot[FB].N.Quest[BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] =
                { 216674 }
            end
        end

        -- 剃刀沼泽
        do
            local FB_5 = GetRealZoneText(47)
            BG.Loot[FB].Team[FB_5] = {
                [L["亡语者贾格巴"]] = { 2816, 6685, 6682, },
                [L["主宰拉姆塔斯"]] = { 6687, 6686, },
                [L["刺鬃守卫"]] = { 6679, },
                [L["暴怒的阿迦赛罗斯"]] = { 6691, 6690, },
                [L["盲眼猎手"]] = { 6695, 6697, 6696, },
                [L["卡尔加·刺肋"]] = { 6693, 6694, 6692, },
                [L["唤地者哈穆加"]] = { 6689, 6688, },
                [L["小怪"]] = { 2264, 1488, 4438, 1978, 2039, 1727, 776, 1976, 1975, 2549, },
                [BG.STC_y1(QUESTS_LABEL)] = { 4197, 6725, 6742 },
            }
            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    6972,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(ClassQuest(1))] = {
                    7133,
                }
            end
        end
        -- 血色
        do
            local FB_5 = GetRealZoneText(189)
            BG.Loot[FB].Team[FB_5] = {
                [L["审讯员韦沙斯"]] = { 7682, },
                [L["永醒的艾希尔"]] = { 7709, 217295, 217296, },
                [L["死灵勇士"]] = { 217294, 7690, 7689, },
                [L["铁脊死灵"]] = { 7688, 7687, 7686, },
                [L["血法师萨尔诺斯"]] = { 7685, 7684, },
                [L["驯犬者洛克希"]] = { 7710, 7756, 3456, },
                [L["奥法师杜安"]] = { 7714, 217299, 217298, 217297, },
                [L["赫洛德"]] = { 7719, 7718, 10330, 7717, },
                [L["法尔班克斯"]] = { 19507, 19508, 19509, },
                [L["莫格莱尼"]] = { 7724, 10330, 7726, 217302, },
                [L["怀特迈恩"]] = { 217300, 217301, 7721, },
                [L["小怪"]] = { 5819, 7755, 7727, 7728, 7759, 7760, 7754, 10332, 1992, 2262, 7787,
                    7729, 7761, 7752, 8226, 7786, 5756, 7736, 8225, 7753, 7730, 7758, 7757, 10328,
                    10331, 10329, 10333, },
            }

            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = {
                    6830, 6829, 6831, 11262,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = {
                    6802, 6803, 10711,
                }
            end
        end
        -- 剃刀高地
        do
            local FB_5 = GetRealZoneText(129)
            BG.Loot[FB].Team[FB_5] = {
                [L["图特卡什"]] = { 217293, 10775, 10777, },
                [L["火眼莫德雷斯"]] = { 217290, 217292, 217291, },
                [L["暴食者"]] = { 10774, 10772, },
                [L["拉戈斯诺特"]] = { 10768, 10767, 10758, },
                [L["寒冰之王亚门纳尔"]] = { 10763, 217288, 217289, 10761, 10765, },
                [L["腐烂的普雷莫尔"]] = { 10766, 10760, },
                [L["小怪"]] = { 10574, 10581, 10583, 10584, 10578, 10582, 10572, 10567, 10571, 10570, 10573, },
                [BG.STC_y1(QUESTS_LABEL)] = { 10823, 10824, 10710 },
            }
        end
        -- 奥达曼
        do
            local FB_5 = GetRealZoneText(70)
            BG.Loot[FB].Team[FB_5] = {
                [L["鲁维罗什"]] = { 217304, 217307, 217305, 217306 },
                [L["艾隆纳亚"]] = { 9409, 217303, 217704, },
                [L["石头看守者"]] = { 9410, 9411, },
                [L["小怪"]] = { 9431, 9429, 9420, 9430, 9397, 9406, 9428, 223537, 9396, 9393, 9381, 9426, 9422,
                    9465, 9384, 9386, 9427, 9392, 9424, 9383, 9425, 9423, 9391, },
                [ClassQuest(8)] = { 9517, 7515 },
            }
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][L["埃瑞克"]] = { 9394, 9398, }
                BG.Loot[FB].Team[FB_5][L["巴尔洛戈"]] = { 9401, }
                BG.Loot[FB].Team[FB_5][L["奥拉夫"]] = { 9404, }
            end
        end
    end

    -- P3
    do
        local FB = "Temple"
        -- 神庙
        do
            BG.Loot[FB].N.boss1 = { 220637, 220636, 220537, 220539, 220554, 220527, 220529, 220511, 220561, 220615, 220567, 220580, 220602, 220568, 220635, }
            BG.Loot[FB].N.boss2 = { 220637, 220636, 221281, 220538, 220550, 220552, 220518, 220542, 220546, 220540, 220545, 220541, 220565, 220569, 220571, 221484, }
            BG.Loot[FB].N.boss3 = { 220637, 220636, 220555, 220528, 220532, 220558, 220560, 220516, 220522, 220548, 220611, 220533, 220591, 220674, 220572, 220638, }
            BG.Loot[FB].N.boss4 = { 220637, 220636, 221298, 220536, 220551, 220549, 220519, 220521, 220544, 220609, 220566, 220594, 220587, 220581, 220584, }
            BG.Loot[FB].N.boss5 = { 220637, 220636, 220625, 220623, 220624, 220556, 220515, 220547, 220535, 220576, 220583, 220575, 220578, 220601, 220605, 220586, }
            BG.Loot[FB].N.boss6 = { 220637, 220636, 221298, 220553, 220559, 220512, 220514, 220543, 220563, 220965, 220598, 220599, 220597, 220607, 220606, 220596, 220589, }
            BG.Loot[FB].N.boss7 = { 221475, 220637, 220636, 221298, 220622, 220523, 220564, 220574, 220600, 220604, 220603, 220595, 220579, 220585, 220582, 220573, }
            BG.Loot[FB].N.boss8 = { 220637, 220636, 220557, 220562, 220608, 220530, 220577, 220534, 220590, 220686, 220588, 220634, 220632, 220633, 220620, }
            BG.Loot[FB].N.boss9 = { 220637, 220636, 221021, 221312, }
            BG.Loot[FB].N.boss10 = {}
            BG.Loot[FB].N.boss6other = { 224409 }
            BG.Loot[FB].N.boss8other = { 220626, 220630, 220628, 220627, 220629, }
            BG.Loot[FB].N.boss10other = { 220783, 220683, 220680, 220784, 220685, 220681, 220781, 220684, 220679, 220669, 220672, 220779, 220670, 220675, 220780, 220671, 220673, 220778, 220676, 220677, 220678, 220666, 220665, 220660, 220657, 220668, 220664, 220662, 220659, 220658, 220661, 220663, 220667, 220653, 220650, 220642, 220648, 220652, 220656, 220643, 220651, 220654, }

            if BG.IsAlliance() then
                tinsert(BG.Loot[FB].N.boss8, 1, 221346)
            else
                tinsert(BG.Loot[FB].N.boss8, 1, 221363)
            end

            -- 兑换物
            BG.Loot[FB].ExchangeItems = {
                -- MS/FS/SS/XD
                [220637] = { 220783, 220683, 220680, 220784, 220685, 220681, 220781, 220684, 220679, 220669, 220672, 220779, 220670, 220675, 220780, 220671, 220673, 220778, },
                -- ZS/QS/SM/LR/DZ
                [220636] = { 220676, 220677, 220678, 220666, 220665, 220660, 220657, 220668, 220664, 220662, 220659, 220658, 220661, 220663, 220667, 220653, 220650, 220642, 220648, 220652, 220656, 220643, 220651, 220654, },
                [220589] = { 224409 }
            }
            if BG.IsAlliance() then
                BG.Loot[FB].ExchangeItems[221346] = { 220626, 220630, 220628, 220627, 220629, }
            else
                BG.Loot[FB].ExchangeItems[221363] = { 220626, 220630, 220628, 220627, 220629, }
            end
            for item, v in pairs(BG.Loot[FB].ExchangeItems) do -- 提前缓存
                GetItemInfo(item)
            end

            if classID == 1 then
                BG.Loot[FB].N.Quest[ClassQuest(1)] = { 20521, 20130, 20517, }
            elseif classID == 2 then
                BG.Loot[FB].N.Quest[ClassQuest(2)] = { 20504, 20512, 20505, }
            elseif classID == 3 then
                BG.Loot[FB].N.Quest[ClassQuest(3)] = { 20083, 19991, 19992, }
            elseif classID == 4 then
                BG.Loot[FB].N.Quest[ClassQuest(4)] = { 19984, 20255, 19982, }
            elseif classID == 5 then
                BG.Loot[FB].N.Quest[ClassQuest(5)] = { 19990, 20082, 20006, }
            elseif classID == 7 then
                BG.Loot[FB].N.Quest[ClassQuest(7)] = { 20369, 20556, 20503, }
            elseif classID == 8 then
                BG.Loot[FB].N.Quest[ClassQuest(8)] = { 20035, 20037, 20036, }
            elseif classID == 9 then
                BG.Loot[FB].N.Quest[ClassQuest(9)] = { 20536, 20534, 20530, }
            elseif classID == 11 then
                BG.Loot[FB].N.Quest[ClassQuest(11)] = { 22274, 22272, 22458, }
            end

            -- 团本任务
            BG.Loot[FB].N.Quest[BG.STC_y1(QUESTS_LABEL)] = { 1490, 223325, 223326, 223327, 221781, 223329, 223324, 221782, 221474, }
        end

        -- 奥达曼
        do
            local FB_5 = GetRealZoneText(70)
            BG.Loot[FB].Team[FB_5] = {
                [L["鲁维罗什"]] = { 217304, 217307, 217305, 217306 },
                [L["艾隆纳亚"]] = { 9409, 217303, 217704, },
                [L["石头看守者"]] = { 9410, 9411, },
                [L["加加恩·火锤"]] = { 11310, 9412, 11311, 9419, },
                [L["格瑞姆洛克"]] = { 223535, 223536, 9414, },
                [L["阿扎达斯"]] = { 11118, 9413, 9418, },
                [L["小怪"]] = { 9431, 9429, 9420, 9430, 9397, 9406, 9428, 223537, 9396, 9393, 9381, 9426, 9422,
                    9465, 9384, 9386, 9427, 9392, 9424, 9383, 9425, 9423, 9391, },
                [ClassQuest(8)] = { 9517, 7515 },
                [BG.STC_y1(QUESTS_LABEL)] = { 4746, 9522, 10358, 10359 },
            }
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][L["埃瑞克"]] = { 9394, 9398, }
                BG.Loot[FB].Team[FB_5][L["巴尔洛戈"]] = { 9401, }
                BG.Loot[FB].Team[FB_5][L["奥拉夫"]] = { 9404, }
            end

            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = {
                    4980, 9626, 9627, 6723, 7673,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = {
                    7888,
                }
            end
        end
        -- 祖尔法拉克
        do
            local FB_5 = GetRealZoneText(209)
            BG.Loot[FB].Team[FB_5] = {
                [L["安图苏尔"]] = { 9640, 223532, 9639, 9379, 223526, },
                [L["巫医祖穆拉恩"]] = { 223534, 18082, },
                [L["暗影祭司塞瑟斯"]] = { 9470, 223529, 223530, 9475, },
                [L["灰尘怨灵"]] = { 223533, },
                [L["加兹瑞拉"]] = { 223528, 223527, },
                [L["乌克兹·沙顶"]] = { 9479, 223531, 9478, 9477, 11086, 223526, },
                [L["泽雷利斯"]] = { 223962, },
                [L["小怪"]] = { 9512, 9484, 862, 6440, 9483, 2040, 5616, 9511, 9481, 9480, 9482, },
                [BG.STC_y1(QUESTS_LABEL)] = { 11122, 9527, 9531, 9533, 9534 },
            }
        end
        -- 玛拉顿
        do
            local FB_5 = GetRealZoneText(349)
            BG.Loot[FB].Team[FB_5] = {
                [L["诺克赛恩"]] = { 17746, 17744, 17745, },
                [L["锐刺鞭笞者"]] = { 17749, 223543, 17750, 17751, },
                [L["维利塔恩"]] = { 17755, 17754, 17752, },
                [L["收割者麦什洛克"]] = { 17767, 17741, 17742, },
                [L["被诅咒的塞雷布拉斯"]] = { 223525, 17739, 17738, },
                [L["兰斯利德"]] = { 223522, 17736, 223523, 223524, },
                [L["工匠吉兹洛克"]] = { 223545, 223542, 223520, },
                [L["洛特格里普"]] = { 223521, 17728, 17730, },
                [L["瑟莱德丝公主"]] = { 223964, 223519, 223541, 17714, 17711, 17713, 223518, 221780, },
                [L["小怪"]] = {},
                [BG.STC_y1(QUESTS_LABEL)] = { 17743, 17705, 17753, 17775, 17770, 17779, 17774, 17773,
                    17777, 17778, 17776, 17768, 17772, },
            }
        end
        -- 黑石深渊
        do
            local FB_5 = GetRealZoneText(230)
            BG.Loot[FB].Team[FB_5] = {
                [L["洛考尔"]] = { 22234, 11632, 11631, },
                [L["审讯官格斯塔恩"]] = { 11626, 11624, 22240, 223539, },
                [L["驯犬者格雷尔玛尔"]] = { 11623, 11627, 223540, 223982, },
                [L["竞技场-修行者高罗什"]] = {},
                [L["竞技场-格里兹尔"]] = { 223544, 11703, 22270, 11702, },
                [L["竞技场-剜眼者"]] = { 223987, 11679, 11686, },
                [L["竞技场-破坏者奥科索尔"]] = { 11665, 11662, 223985, },
                [L["竞技场-阿努希尔"]] = { 11678, 223986, 11675, },
                [L["竞技场-爬行者赫杜姆"]] = { 11633, 223984, 11635, },
                [L["控火师罗格雷恩"]] = { 223981, 223980, 11748, 223538, },
                -- [L["黑色宝库"]] = {},
                [L["典狱官斯迪尔基斯"]] = { 223983, },
                -- [L["维雷克"]] = {},
                -- [L["卫兵杜格瑞普"]] = {},
                [L["弗诺斯·达克维尔"]] = { 11839, 22223, 11842, 11841, },
                -- [L["伊森迪奥斯"]] = {},
                -- [L["贝尔加"]] = {},
                -- [L["安格弗将军"]] = {},
                -- [L["傀儡统帅阿格曼奇"]] = {},
                -- [L["黑铁酒吧-霍尔雷·黑须"]] = {},
                -- [L["黑铁酒吧-普拉格"]] = {},
                -- [L["黑铁酒吧-方阵"]] = {},
                -- [L["弗莱拉斯大使"]] = {},
                -- [L["无敌的潘佐尔"]] = {},
                -- [L["七贤"]] = {},
                -- [L["玛格姆斯"]] = {},
                -- [L["铁炉堡公主茉艾拉·铜须"]] = {},
                -- [L["达格兰·索瑞森大帝"]] = {},
                [L["小怪"]] = { 12549, 12552, 12542, 12546, 12550, 12555, 12527, 12531, 12535, 12528, },
                [BG.STC_y1(QUESTS_LABEL)] = { 12113, 12114, 12112, 12115, 11865, 11963, 12049, 11962,
                    11866, 11964, 12000, },
            }

            if BG.IsAlliance() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_ALLIANCE .. QUESTS_LABEL)] = {
                    12018, 12021, 12041, 12061, 12062, 12065,
                }
            end
            if BG.IsHorde() then
                BG.Loot[FB].Team[FB_5][BG.STC_y1(FACTION_HORDE .. QUESTS_LABEL)] = {

                }
            end
        end
    end
end

-- 声望装备
do
    -- P1
    do
        local FB = "BD"
        if BG.IsAlliance() then
            -- 战歌
            BG.Loot[FB].Faction = {
                ["890:2"] = { 21568, 21566, },
                ["890:3"] = { 20444, 20428, 20431, 20439, },
                ["890:4"] = { 212580, 212581, 212582, 212583, },
            }
        end
        if BG.IsHorde() then
            -- 战歌
            BG.Loot[FB].Faction = {
                ["889:2"] = { 21568, 21566, },
                ["889:3"] = { 20442, 20427, 20426, 20429, },
                ["889:4"] = { 212584, 212585, 212586, 212587, },
            }
        end
    end
    -- P2
    do
        local FB = "Gno"
        if BG.IsAlliance() then
            BG.Loot[FB].Faction = {
                -- 战歌
                ["890:2"] = { 21567, 21565, },
                ["890:3"] = { 19541, 19533, 19525, 19517, 19540, 19532, 19524, 19515, },
                ["890:4"] = { 19564, 19548, 19556, 19572, },
                ["890:5"] = { 19597, 19590, 19584, 19581, },

                -- 阿拉希
                ["509:2"] = { 21119, 21118, },
                ["509:3"] = { 20099, 20117, 20105, 20090, 20108, 20126, 20098, 20116, 20104, 20089, 20107, 20125, },
                ["509:4"] = { 20096, 20114, 20102, 20093, 20111, 20129, 20095, 20113, 20101, 20092, 20110, 20128, },
            }
        end
        if BG.IsHorde() then
            -- 阿拉希
            BG.Loot[FB].Faction = {
                -- 战歌
                ["889:2"] = { 21567, 21565, },
                ["889:3"] = { 19537, 19529, 19521, 19513, 19536, 19528, 19520, 19512, },
                ["889:4"] = { 19560, 19544, 19552, 19568, },
                ["889:5"] = { 19597, 19590, 19584, 19581, },

                -- 阿拉希
                ["510:2"] = { 21120, 21116, },
                ["510:3"] = { 20164, 20191, 20172, 20152, 20197, 20207, 20166, 20192, 20173, 20153, 20198, 20206, },
                ["510:4"] = { 20162, 20188, 20169, 20157, 20201, 20210, 20161, 20187, 20168, 20156, 20200, 20209, },
            }
        end
    end
    -- P3
    do
        local FB = "Temple"
        if BG.IsAlliance() then
            BG.Loot[FB].Faction = {
                -- 战歌
                ["890:2"] = {},
                ["890:3"] = { 19539, 19531, 19523, 19516, },
                ["890:4"] = { 19563, 19547, 19555, 19571, },
                ["890:5"] = { 19596, 19589, 19583, 19580, },

                -- 阿拉希
                ["509:2"] = { 21117, },
                ["509:3"] = { 20097, 20115, 20103, 20088, 20106, 20124, 20089, 20107, 20125, },
                ["509:4"] = { 20094, 20112, 20100, 20091, 20109, 20127, 20092, 20110, 20128, },
            }
        end
        if BG.IsHorde() then
            -- 阿拉希
            BG.Loot[FB].Faction = {
                -- 战歌
                ["889:2"] = {},
                ["889:3"] = { 19535, 19527, 19519, 19511, },
                ["889:4"] = { 19559, 19543, 19551, 19567, },
                ["889:5"] = { 19596, 19589, 19583, 19580, },

                -- 阿拉希
                ["510:2"] = { 21115, },
                ["510:3"] = { 20165, 20193, 20174, 20151, 20196, 20205, 20153, 20198, 20206, },
                ["510:4"] = { 20160, 20189, 20170, 20155, 20202, 20211, 20156, 20200, 20209, },
            }
        end

        local factionID = 2641
        BG.Loot[FB].Faction[factionID .. ":2"] = { 224004, 224005, 224006, 221362, 221381, 221411, 221392, 221431, 223648, 221386, 221369, 221378, 221432, 221400, 221407, 221374, 221424, 221379, 221416, 221427, 221399, 221393, 221383, 221389, 221394, 221387, 221436, 221409, 221426, 221405, 221403, 221412, 221396, 221421, 221415, 221438, 221420 }
        BG.Loot[FB].Faction[factionID .. ":3"] = { 213407, 221376, 221391, 221408, 221193, 221380, 221425, 221430, 221377, 221406, 221384, 221434, 221390, 221413, 221437, 221382, 221402, 221422, 221410, 221388, 221419, 221385, 221397, 221401, 221417, 221395, 221429, 221423, 221404, 221414, 221398, 221435 }
        BG.Loot[FB].Faction[factionID .. ":4"] = { 221441, 220649, 221439 }
        BG.Loot[FB].Faction[factionID .. ":5"] = { 220621, 221442, 221440, 221443 }
    end
end

-- PVP
do
    -- P1
    do
        local FB = "BD"
        if BG.IsAlliance() then
            BG.Loot[FB].Pvp = {
                ["Alliance:2"] = { 18854, 18856, 18857, 18858, 18862, 18863, 18864, 18859 }, -- 徽记
                ["Alliance:3"] = { 213087 },                                                 -- 中士的披风
            }
        end
        if BG.IsHorde() then
            BG.Loot[FB].Pvp = {
                ["Horde:2"] = { 18834, 18846, 18849, 18852, 18851, 18853, 18845, 18850 }, -- 徽记
                ["Horde:3"] = { 213088 },                                                 -- 中士的披风
            }
        end
    end

    -- P2
    do
        local FB = "Gno"
        if BG.IsAlliance() then
            BG.Loot[FB].Pvp = {
                ["Alliance:2"] = { 18854, 18856, 18857, 18858, 18862, 18863, 18864, 18859 }, -- 徽记
                ["Alliance:3"] = { 213087, 18440 },                                          -- 中士的披风
                ["Alliance:4"] = { 18442 },                                                  -- 军士长的徽记
                ["Alliance:5"] = { 216938, 216701, 216702, 216698, 216699, 216700, },        -- 新徽记、士官长护腕
            }
        end
        if BG.IsHorde() then
            BG.Loot[FB].Pvp = {
                ["Horde:2"] = { 18834, 18846, 18849, 18852, 18851, 18853, 18845, 18850 },
                ["Horde:3"] = { 213088, 18427 },
                ["Horde:4"] = { 15200 },
                ["Horde:5"] = { 216939, 216703, 216704, 216705, 216706, 216707 },
            }
        end
    end

    -- P3
    do
        local FB = "Temple"
        if BG.IsAlliance() then
            BG.Loot[FB].Pvp = {
                ["Alliance:2"] = { 18854, 18856, 18857, 18858, 18862, 18863, 18864, 18859 }, -- 徽记
                ["Alliance:3"] = { 18441, },                                                 -- 中士的披风
                ["Alliance:4"] = { 18444, },                                                 -- 军士长的徽记
                ["Alliance:5"] = { 216938, 216701, 216702, 216698, 216699, 216700,           -- 新徽记、士官长护腕
                    220806, 220799, 220812, 220811, 220817, 220814, 223076, 223077, 220829, 220837, 220856, 220860, 220880, 220884, 220866, 220862, 220890, 220891, 220897, 220895, },
                ["Alliance:6"] = { 220892, 220893, 220886, 220888, 220868, 220864, 220878, 220882, 220854, 220858, 220828, 220832, 223078, 223074, 220815, 220816, 220813, 220809, 220794, 220797, },
                ["Alliance:7"] = { 220896, 220894, 220889, 220887, 220872, 220870, 220874, 220876, 220850, 220852, 220822, 220825, 223075, 223073, 220819, 220818, 220810, 220808, 220804, 220795, },
            }
        end
        if BG.IsHorde() then
            BG.Loot[FB].Pvp = {
                ["Horde:2"] = { 18834, 18846, 18849, 18852, 18851, 18853, 18845, 18850 },
                ["Horde:3"] = { 16341, },
                ["Horde:4"] = { 18428, },
                ["Horde:5"] = { 216939, 216703, 216704, 216705, 216706, 216707,
                    220898, 220900, 220908, 220909, 220881, 220885, 220867, 220863, 220857, 220861, 220830, 220836, 220831, 220835, 220845, 220846, 220843, 220840, 220807, 220800, },
                ["Horde:6"] = { 220903, 220902, 220904, 220906, 220879, 220883, 220869, 220865, 220855, 220859, 220827, 220833, 220826, 220834, 220844, 220847, 220838, 220839, 220801, 220798, },
                ["Horde:7"] = { 220899, 220901, 220907, 220905, 220875, 220877, 220873, 220871, 220851, 220853, 220821, 220824, 220820, 220823, 220848, 220849, 220842, 220841, 220803, 220796, },
            }
        end
    end
end

-- 专业制造
do
    -- P1
    local FB = "BD"
    BG.Loot[FB].Profession = {
        ["锻造"] = { 2870, 210794, 210773, },
        ["制皮"] = { 6468, 4253, 211423, 211502, },
        ["裁缝"] = { 4320, 210795, 210781, 215366, 215365 },
    }
    -- P2
    local FB = "Gno"
    BG.Loot[FB].Profession = {
        ["锻造"] = { 215161, 215167, 217273, 217275, 217277, 217279, 217281, 217283, 217285, 3836, 3840, 3842, 3844, 3846, 3849, 3850, 3851, 3852, 3854, 3855, 3856, 7913, 7914, 7915, 7916, 7917, 7918, 7919, 7920, 7921, 7924, 7941, 7942, 7943, 7963, 10423, 12259, 12260, 17704, },
        ["制皮"] = { 215114, 215166, 215381, 215382, 217259, 217261, 217263, 217265, 217267, 217268, 217270, 4255, 4256, 4257, 4259, 4262, 4264, 4455, 4456, 5782, 5783, 5963, 5964, 5965, 7373, 7374, 7375, 7377, 7378, 7386, 7387, 7390, 7391, 8174, 8175, 8176, 8192, 8198, 8203, 8204, 8205, 17721, 18238, 18948, },
        ["裁缝"] = { 215111, 215365, 215366, 217245, 217246, 217247, 217248, 217250, 217252, 217253, 217255, 217256, 217257, 4323, 4327, 4328, 4329, 7052, 7053, 7054, 7056, 7057, 7060, 7064, 7065, 10001, 10002, 10003, 10004, 10007, 10008, 10009, 10018, 10019, 10021, 10023, 10042, },
        ["工程"] = { 213390, 215115, 4393, 10499, 10500, 10501, 10502, 10508, 10510, 10518, },
        ["附魔"] = { 217287, },
    }
    -- P3
    local FB = "Temple"
    BG.Loot[FB].Profession = {
        ["锻造"] = { 220738, 220740, 220739, 8708, 10418, 7947, 12774, 12773, 7946, 7954, 7945, 11608, 7961, 7944, 7960, 7959, 7931, 7932, 12624, 12415, 7929, 12416, 7937, 7934, 12428, 7928, 12405, 7939, 7935, 7930, 7936, 7933, 7938, 7927, 7926, 12424, 12406, 12425, 12408, },
        ["制皮"] = { 220747, 220742, 220744, 220748, 220745, 220743, 15045, 15046, 8367, 8347, 8215, 8216, 15064, 8349, 8211, 15073, 15071, 8213, 8197, 15091, 15074, 15083, 8346, 8348, 8345, 8214, 15057, 15054, 8212, 8202, 8193, 15061, 15067, 8210, 15092, 15084, },
        ["裁缝"] = { 220749, 220751, 220750, 14141, 14100, 14042, 13857, 13858, 13868, 13869, 14103, 14134, 13860, 10041, 10025, 10033, 10030, 10024, 10029, 10028, 10027, 10044, 10031, 10026, 13863, 14101, 14142, 14043, 13870, 14107, 14132, 14143, 13856, },
        ["工程"] = { 221025, 221027, 221026, 10721, 7189, 10724, 15999, 10504, 10588, 10726, 10503, 10506, 10545, 10542, 10543, 18637, 18634, 10576, 10727, 10645, 10725, 10587, 10720, 10716, 16004, 15995, },
        ["附魔"] = { 11811 },
    }
end

-- 非副本任务
do
    -- P1
    do
        local FB = "BD"
        -- 专业
        BG.Loot[FB].Quest.Profession1 = {
            FBname = L["锻造/制皮/裁缝"],
            color = BG.y1,
        }
        BG.Loot[FB].Quest.Profession1.itemID = { 211420 }
    end
    -- P2
    do
        local FB = "Gno"
        BG.Loot[FB].Quest.FS = {
            FBname = "",
            color = BG.y1,
            classID = 8,
            itemID = { 7514, 7513, 11263, }
        }
        if classFilename == "MAGE" then
            tinsert(BG.Loot[FB].Quest.FS.itemID, 217497)
        end
        BG.Loot[FB].Quest.ZS = {
            FBname = "",
            color = BG.y1,
            classID = 1,
            itemID = { 6975, 6977, 6976 }
        }
        BG.Loot[FB].Quest.SS = {
            FBname = "",
            color = BG.y1,
            classID = 9,
            itemID = { 6900, 15108, 15107 }
        }
        if BG.IsHorde() then
            BG.Loot[FB].Quest.horde = {
                FBname = "",
                color = BG.y1,
                faction = 2,
                itemID = { 18585, 18586, }
            }
        end
    end
    -- P3
    do
        local FB = "Temple"
        if classFilename == "MAGE" then
            BG.Loot[FB].Quest[classFilename] = {
                FBname = "",
                color = BG.y1,
                classID = classID,
                itemID = { 221344, }
            }
        elseif classFilename == "DRUID" then
            BG.Loot[FB].Quest[classFilename] = {
                FBname = "",
                color = BG.y1,
                classID = classID,
                itemID = { 219326, }
            }
        elseif classFilename == "WARRIOR" then
            BG.Loot[FB].Quest[classFilename] = {
                FBname = "",
                color = BG.y1,
                classID = classID,
                itemID = { 219223, }
            }
        elseif classFilename == "PALADIN" then
            BG.Loot[FB].Quest[classFilename] = {
                FBname = "",
                color = BG.y1,
                classID = classID,
                itemID = { 221518, }
            }
        elseif classFilename == "HUNTER" then
            BG.Loot[FB].Quest[classFilename] = {
                FBname = "",
                color = BG.y1,
                classID = classID,
                itemID = { 219345, }
            }
        elseif classFilename == "ROGUE" then
            BG.Loot[FB].Quest[classFilename] = {
                FBname = "",
                color = BG.y1,
                classID = classID,
                itemID = { 219343, }
            }
        elseif classFilename == "WARLOCK" then
            BG.Loot[FB].Quest[classFilename] = {
                FBname = L["小鬼探险"],
                color = BG.y1,
                classID = classID,
                itemID = { 221518, 223214, 223218 }
            }
        end

        BG.Loot[FB].Quest.Profession1 = {
            FBname = "",
            color = BG.y1,
        }
        BG.Loot[FB].Quest.Profession1.itemID = { 220689 }
    end
end

-- 世界掉落
do
    -- P1
    local FB = "BD"
    BG.Loot[FB].World = { 12978, 12977, 5183, 12982, 12979, 12988, 12987, 12985, 6332, 2879, 12996, 12994,
        2911, 12997, 2059, 1121, 12999, 12998, 13010, 2800, 13012, 13011, 13031, 13005, 720, 13131, 13099,
        13097, 13114, 13094, 13079, 1717, 12976, 12975, 5423, 935, 13136, 12984, 12983, 12989, 12992, 12990,
        2256, 890, 3021, 2236, 2194, 13041, 13016, 4454, 4446, 2011, 13062, 13032, 2098, 1493, 13057, 3203,
        13024, 2878 }
    -- P2
    local FB = "Gno"
    BG.Loot[FB].World = {
        -- 武器
        873, 2825, 2164, 1982, 870, 869, 868,
        6327, 13026, 13138, 9359, 13064, 13034, 13038, 8223, 1602, 13045, 1722, 2912,
        2815, 2299, 937, 934, 13020, 12974, 1265, 13051, 8006, 13137, 13033, 6331, 9378, 13037, 13042,
        13049, 936, 13063, 7753, 9385, 13054, 13048, 13019, 13017, 791, 13058, 2877,
        13025, 1726,
        -- 护甲
        867, 1980, 1204, 14549, 1981,
        5257, 1718, 1716, 2278, 2721, 9375, 13095, 13117, 2951, 13108, 2276, 13071, 2802, 13110, 13068,
        13129, 13084, 2277, 1713, 13029, 13087, 9434, 13100, 13132, 13115, 1678, 13145, 13127,
        13081, 13121, 1714, 13093, 13088, 2565, 3020, 13199, 9435, 13103, 13106, 1715, 9395,
        9405, 13119, 13124, 13105,
    }
    -- P3
    local FB = "Temple"
    BG.Loot[FB].World = {
        -- 史诗
        14551, 871, 2291, 942, 943, 2100, 809, 2163, 2824, 812, 2915, 810, 940, 3075, 1979, 1315, 14552,
        1169, 1447, 17007,
        -- 精良
        13018, 13102, 8190, 7734, 11302, 13052, 13022, 6660, 4091, 13014, 13030, 13039, 13067, 13066,
        13089, 13074, 13125, 13043, 754, 13139, 1607, 13122, 4090, 13008, 10623, 10627, 13073, 13120,
        1203, 13027, 13134, 9433, 13009, 13059, 13055, 1720, 13046, 13065, 13112, 2564, 13076, 13035,
        10634, 13021, 13128, 13144, 13082, 13109, 13126, 5266, 1721, 13111, 13085,
        223256, 223262, 223263, 223249, 223251, 223250, 223248,
    }
end

-- 赛季服货币/牌子
local function AddDB(FB, get, itemID, count, coin, color, type)
    if type then
        GetItemInfo(count)
    end

    get = get or ""
    count = count or ""
    coin = coin or ""
    type = type or ""

    tinsert(BG.Loot[FB].Sod_Currency, {
        [itemID] = get .. "-" .. count .. "-" .. coin .. "-" .. color .. "-" .. type
    })
end
-- 血月
do
    -- P2
    local FB = "Gno"
    local get = L["荆棘谷 血月活动"]
    local coin = 133786
    local color = "FF6347"
    AddDB(FB, get, 216621, 2, coin, color)
    AddDB(FB, get, 216620, 2, coin, color)
    AddDB(FB, get, 216623, 2, coin, color)
    AddDB(FB, get, 216622, 2, coin, color)
    AddDB(FB, get, 216495, 15, coin, color)
    AddDB(FB, get, 216496, 10, coin, color)
    AddDB(FB, get, 216497, 15, coin, color)
    AddDB(FB, get, 216498, 5, coin, color)
    AddDB(FB, get, 216499, 15, coin, color)
    AddDB(FB, get, 216500, 5, coin, color)
    AddDB(FB, get, 216501, 5, coin, color)
    AddDB(FB, get, 216502, 15, coin, color)
    AddDB(FB, get, 216503, 5, coin, color)
    AddDB(FB, get, 216615, 5, coin, color)
    AddDB(FB, get, 216504, 15, coin, color)
    AddDB(FB, get, 216505, 5, coin, color)
    AddDB(FB, get, 216506, 15, coin, color)
    AddDB(FB, get, 216607, 5, coin, color)
    AddDB(FB, get, 216507, 5, coin, color)
    AddDB(FB, get, 216508, 5, coin, color)
    AddDB(FB, get, 216509, 5, coin, color)
    AddDB(FB, get, 216510, 5, coin, color)
    AddDB(FB, get, 216511, 5, coin, color)
    AddDB(FB, get, 216512, 5, coin, color)
    AddDB(FB, get, 216513, 5, coin, color)
    AddDB(FB, get, 216516, 5, coin, color)
    AddDB(FB, get, 216517, 5, coin, color)
    AddDB(FB, get, 216518, 5, coin, color)
    AddDB(FB, get, 216519, 5, coin, color)
    AddDB(FB, get, 216520, 10, coin, color)
    AddDB(FB, get, 216521, 5, coin, color)
    AddDB(FB, get, 216522, 5, coin, color)

    -- P3
    local FB = "Temple"
    local get = L["荆棘谷 血月活动"]
    local coin = 237282
    local color = "FF6347"
    AddDB(FB, get, 221447, 15, coin, color)
    AddDB(FB, get, 221446, 25, coin, color)
    AddDB(FB, get, 221448, 15, coin, color)
    AddDB(FB, get, 221450, 25, coin, color)
    AddDB(FB, get, 221451, 25, coin, color)
    AddDB(FB, get, 221452, 15, coin, color)
    AddDB(FB, get, 221453, 15, coin, color)
    AddDB(FB, get, 221454, 15, coin, color)
    AddDB(FB, get, 221457, 15, coin, color)
    AddDB(FB, get, 221455, 15, coin, color)
    AddDB(FB, get, 221456, 25, coin, color)
    AddDB(FB, get, 220173, 25, coin, color)
    AddDB(FB, get, 221459, 15, coin, color)
    AddDB(FB, get, 221458, 15, coin, color)
    AddDB(FB, get, 221460, 25, coin, color)
    AddDB(FB, get, 221462, 25, coin, color)
    AddDB(FB, get, 221465, 25, coin, color)
    AddDB(FB, get, 221464, 15, coin, color)
    AddDB(FB, get, 221463, 15, coin, color)
    AddDB(FB, get, 221466, 15, coin, color)
    AddDB(FB, get, 221467, 15, coin, color)
    AddDB(FB, get, 221469, 25, coin, color)
    AddDB(FB, get, 221468, 15, coin, color)
end
-- 荒野祭品
do
    -- P3
    local FB = "Temple"
    local get = L["费伍德 影牙使者"]
    local coin = 132119
    local color = "98FB98"
    AddDB(FB, get, 223192, 15, coin, color)
    AddDB(FB, get, 223193, 15, coin, color)
    AddDB(FB, get, 223194, 12, coin, color)
    AddDB(FB, get, 223195, 12, coin, color)
    AddDB(FB, get, 223196, 15, coin, color)
    AddDB(FB, get, 223197, 12, coin, color)
end
-- 马戏团
do
    -- P3
    local FB = "Temple"
    local get = L["暗月马戏团"]
    local coin = 132119
    local color = "7B68EE"
    AddDB(FB, get, 221309, 221289, nil, color, 1)
    AddDB(FB, get, 221307, 221280, nil, color, 1)
    AddDB(FB, get, 221308, 221272, nil, color, 1)
    AddDB(FB, get, 221310, 221299, nil, color, 1)
end


function BG.SortLootItem(items)
    pt("原来：" .. #items)
    local sortItems = {}
    local qualityTbl = {
        quality2 = {},
        quality3 = {},
        quality4 = {},
        quality5 = {},
    }
    for i = #items, 1, -1 do
        local item = items[i]
        local name, link, quality, level, _, _, _, _, EquipLoc, Texture, _, typeID, subclassID = GetItemInfo(item)
        if EquipLoc == "INVTYPE_NON_EQUIP_IGNORE" then
            tinsert(sortItems, item)
            tremove(items, i)
        end
    end
    for ii = 2, 5 do
        for i = #items, 1, -1 do
            local item = items[i]
            local name, link, quality, level, _, _, _, _, EquipLoc, Texture, _, typeID, subclassID = GetItemInfo(item)
            if quality == ii then
                tinsert(qualityTbl["quality" .. ii], item)
                tremove(items, i)
            end
        end

        sort(qualityTbl["quality" .. ii], function(a, b)
            local name, link, quality, level, _, _, _, _, a_EquipLoc, Texture, _, typeID, subclassID = GetItemInfo(a)
            local name, link, quality, level, _, _, _, _, b_EquipLoc, Texture, _, typeID, subclassID = GetItemInfo(b)
            return a_EquipLoc > b_EquipLoc
        end)

        for i = 1, #qualityTbl["quality" .. ii] do
            local item = qualityTbl["quality" .. ii][i]
            tinsert(sortItems, item)
        end
    end
    local text = ""
    for i, item in ipairs(sortItems) do
        text = text .. item .. ","
    end
    pt("现在：" .. #sortItems)
    pt(text)
    BG.After(0.1, function()
        ChatFrame1EditBox:Show()
        ChatFrame1EditBox:SetText(text)
        ChatFrame1EditBox:HighlightText()
        ChatFrame1EditBox:SetFocus()
    end)


    --[[     for ii = 2, 5 do
        for i = 1, #qualityTbl["quality"..ii] do

            for i = #qualityTbl["quality"..ii], 1, -1 do
                local item = qualityTbl["quality"..ii][i]
                local name, link, quality, level, _, _, _, _, EquipLoc, Texture, _, typeID, subclassID = GetItemInfo(item)
                if EquipLoc == "INVTYPE_HEAD" then
                    tinsert(sortItems, item)
                    tremove(qualityTbl["quality"..ii], i)
                -- elseif EquipLoc == "INVTYPE_HEAD" then

                end
            end
        end
    end ]]
end
